threeB/app/controllers/users_controller.rb

INSERT INTO "users" ("fName", "lName", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["fName", "Joey"], ["lName", "Tatú"], ["email", "joeyctatu@gmail.com"], ["created_at", "2020-02-20 11:23:19.623197"], ["updated_at", "2020-02-20 11:23:19.623197"]]
UPDATE "users" SET "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_hash", "$2a$12$Q9rozfui8fqawH3C2ag0NeUDkAqoDt/H2a4PtLzksWoaZZuZiuLni"], ["updated_at", "2020-02-20 11:23:19.932908"], ["id", 1]]
---
    def create
        @user = User.create(user_params)
        @user.password = params[:password]
        @user.avatar.attach(params[:avatar])

        session[:user_id] = @user.id
        if (@user.save!)